app/Http/Controllers/JokeController.php

select * from "jokes" limit 6 offset 6
select count(*) as aggregate from "jokes"
---
    public function index()
    {
        $jokes = Joke::simplePaginate(6);

insert into "jokes" ("setup", "punchline", "updated_at", "created_at") values ('vbvcb', 'vbvc', '2024-12-03 23:11:49', '2024-12-03 23:11:49')
---
    public function store(Request $request)
    {
        $validatedData = $this->validateJoke($request);

        $joke = new Joke();
        $joke->setup = $validatedData['setup'];
        $joke->punchline = $validatedData['punchline'];
        $joke->save();

select * from "jokes" where "jokes"."id" = '1' limit 1
---
    public function show(string $id)
    {
        $joke = Joke::findOrFail($id);